{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "data_NCHW3c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___11", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_conv0_weight_OIHW3i32o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm0_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm0_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "max_pool2d0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_max_pool2d", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "max_pool2d0_NCHW64c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___12", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_conv0_weight_OIHW64i32o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm1_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm1_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu1_NCHW64c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___12", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_conv1_weight_OIHW64i32o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm2_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm2_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_elemwise_add_relu", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[6, 0, 0], [12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu2_NCHW64c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___12", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_conv2_weight_OIHW64i32o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm3_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm3_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[17, 0, 0], [18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu3_NCHW64c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___12", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_conv3_weight_OIHW64i32o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm4_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm4_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu4", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_elemwise_add_relu", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[16, 0, 0], [22, 0, 0], [23, 0, 0], [24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu4_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___13", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_conv2_weight_OIHW8i32o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm6_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm6_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_conv0_weight_OIHW32i64o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm5_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm5_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu5", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_2", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[26, 0, 0], [31, 0, 0], [32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu5_NCHW128c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___14", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_conv1_weight_OIHW128i32o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm7_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm7_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm7_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[35, 0, 0], [36, 0, 0], [37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu6", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_elemwise_add_relu_1", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[27, 0, 0], [28, 0, 0], [29, 0, 0], [30, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu6_NCHW128c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___15", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_conv3_weight_OIHW128i32o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm8_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm8_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu7", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_3", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu7_NCHW128c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___15", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_conv4_weight_OIHW128i32o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm9_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm9_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu8", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_elemwise_add_relu_2", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[40, 0, 0], [46, 0, 0], [47, 0, 0], [48, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu8_NCHW64c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___16", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage3_conv2_weight_OIHW64i16o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm11_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm11_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu8_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___17", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage3_conv0_weight_OIHW8i32o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm10_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm10_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu9", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_4", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[55, 0, 0], [56, 0, 0], [57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu9_NCHW128c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___18", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage3_conv1_weight_OIHW128i16o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm12_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm12_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm12_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[60, 0, 0], [61, 0, 0], [62, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu10", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_elemwise_add_relu_3", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0], [53, 0, 0], [54, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu10_NCHW128c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___19", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage3_conv3_weight_OIHW128i16o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm13_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm13_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu11", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_5", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[66, 0, 0], [67, 0, 0], [68, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu11_NCHW128c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___19", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[70, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage3_conv4_weight_OIHW128i16o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm14_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm14_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu12", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_elemwise_add_relu_4", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[65, 0, 0], [71, 0, 0], [72, 0, 0], [73, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu12_NCHW128c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___19", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage4_conv2_weight_OIHW128i32o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm16_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm16_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu12_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___20", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage4_conv0_weight_OIHW8i32o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm15_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm15_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu13", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_6", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[80, 0, 0], [81, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu13_NCHW512c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___21", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[84, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage4_conv1_weight_OIHW512i32o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm17_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm17_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm17_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_2", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[85, 0, 0], [86, 0, 0], [87, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu14", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_elemwise_add_relu_5", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[76, 0, 0], [77, 0, 0], [78, 0, 0], [79, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu14_NCHW512c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___21", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[90, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage4_conv3_weight_OIHW512i32o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm18_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm18_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu15", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_7", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[91, 0, 0], [92, 0, 0], [93, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu15_NCHW512c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___21", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage4_conv4_weight_OIHW512i32o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm19_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm19_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu16", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_elemwise_add_relu_6", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[90, 0, 0], [96, 0, 0], [97, 0, 0], [98, 0, 0], [99, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "global_avg_pool2d0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_global_avg_pool2d", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "flatten0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___flatten", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_dense0_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_dense0_bias", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "dense0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_dense", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[102, 0, 0], [103, 0, 0], [104, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "softmax0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_softmax", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[105, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    3, 
    4, 
    8, 
    9, 
    10, 
    13, 
    14, 
    15, 
    18, 
    19, 
    20, 
    23, 
    24, 
    25, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    36, 
    37, 
    38, 
    42, 
    43, 
    44, 
    47, 
    48, 
    49, 
    52, 
    53, 
    54, 
    56, 
    57, 
    58, 
    61, 
    62, 
    63, 
    67, 
    68, 
    69, 
    72, 
    73, 
    74, 
    77, 
    78, 
    79, 
    81, 
    82, 
    83, 
    86, 
    87, 
    88, 
    92, 
    93, 
    94, 
    97, 
    98, 
    99, 
    103, 
    104
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107
  ], 
  "heads": [[106, 0, 0]], 
  "attrs": {
    "storage_id": ["list_int", [
        6, 
        0, 
        7, 
        8, 
        9, 
        1, 
        0, 
        1, 
        10, 
        11, 
        12, 
        2, 
        1, 
        13, 
        14, 
        15, 
        2, 
        0, 
        16, 
        17, 
        18, 
        1, 
        0, 
        19, 
        20, 
        21, 
        1, 
        2, 
        22, 
        23, 
        24, 
        25, 
        26, 
        27, 
        0, 
        1, 
        28, 
        29, 
        30, 
        0, 
        1, 
        2, 
        31, 
        32, 
        33, 
        0, 
        2, 
        34, 
        35, 
        36, 
        0, 
        2, 
        37, 
        38, 
        39, 
        1, 
        40, 
        41, 
        42, 
        0, 
        1, 
        43, 
        44, 
        45, 
        0, 
        1, 
        2, 
        46, 
        47, 
        48, 
        0, 
        2, 
        49, 
        50, 
        51, 
        0, 
        2, 
        52, 
        53, 
        54, 
        1, 
        55, 
        56, 
        57, 
        0, 
        3, 
        58, 
        59, 
        60, 
        0, 
        3, 
        2, 
        61, 
        62, 
        63, 
        0, 
        2, 
        64, 
        65, 
        66, 
        0, 
        4, 
        5, 
        67, 
        68, 
        4, 
        5]], 
    "dltype": ["list_str", [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"]], 
    "dtype": ["list_int", [
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0]], 
    "shape": ["list_shape", [
        [1, 3, 224, 224], 
        [1, 1, 224, 224, 3], 
        [2, 1, 7, 7, 3, 32], 
        [2, 1, 1, 32], 
        [2, 1, 1, 32], 
        [1, 2, 112, 112, 32], 
        [1, 2, 56, 56, 32], 
        [1, 1, 56, 56, 64], 
        [2, 1, 3, 3, 64, 32], 
        [2, 1, 1, 32], 
        [2, 1, 1, 32], 
        [1, 2, 56, 56, 32], 
        [1, 1, 56, 56, 64], 
        [2, 1, 3, 3, 64, 32], 
        [2, 1, 1, 32], 
        [2, 1, 1, 32], 
        [1, 2, 56, 56, 32], 
        [1, 1, 56, 56, 64], 
        [2, 1, 3, 3, 64, 32], 
        [2, 1, 1, 32], 
        [2, 1, 1, 32], 
        [1, 2, 56, 56, 32], 
        [1, 1, 56, 56, 64], 
        [2, 1, 3, 3, 64, 32], 
        [2, 1, 1, 32], 
        [2, 1, 1, 32], 
        [1, 2, 56, 56, 32], 
        [1, 8, 56, 56, 8], 
        [4, 8, 1, 1, 8, 32], 
        [4, 1, 1, 32], 
        [4, 1, 1, 32], 
        [2, 2, 3, 3, 32, 64], 
        [2, 1, 1, 64], 
        [2, 1, 1, 64], 
        [1, 2, 28, 28, 64], 
        [1, 1, 28, 28, 128], 
        [4, 1, 3, 3, 128, 32], 
        [4, 1, 1, 32], 
        [4, 1, 1, 32], 
        [1, 4, 28, 28, 32], 
        [1, 4, 28, 28, 32], 
        [1, 1, 28, 28, 128], 
        [4, 1, 3, 3, 128, 32], 
        [4, 1, 1, 32], 
        [4, 1, 1, 32], 
        [1, 4, 28, 28, 32], 
        [1, 1, 28, 28, 128], 
        [4, 1, 3, 3, 128, 32], 
        [4, 1, 1, 32], 
        [4, 1, 1, 32], 
        [1, 4, 28, 28, 32], 
        [1, 2, 28, 28, 64], 
        [16, 2, 1, 1, 64, 16], 
        [16, 1, 1, 16], 
        [16, 1, 1, 16], 
        [1, 16, 28, 28, 8], 
        [8, 16, 3, 3, 8, 32], 
        [8, 1, 1, 32], 
        [8, 1, 1, 32], 
        [1, 8, 14, 14, 32], 
        [1, 2, 14, 14, 128], 
        [16, 2, 3, 3, 128, 16], 
        [16, 1, 1, 16], 
        [16, 1, 1, 16], 
        [1, 16, 14, 14, 16], 
        [1, 16, 14, 14, 16], 
        [1, 2, 14, 14, 128], 
        [16, 2, 3, 3, 128, 16], 
        [16, 1, 1, 16], 
        [16, 1, 1, 16], 
        [1, 16, 14, 14, 16], 
        [1, 2, 14, 14, 128], 
        [16, 2, 3, 3, 128, 16], 
        [16, 1, 1, 16], 
        [16, 1, 1, 16], 
        [1, 16, 14, 14, 16], 
        [1, 2, 14, 14, 128], 
        [16, 2, 1, 1, 128, 32], 
        [16, 1, 1, 32], 
        [16, 1, 1, 32], 
        [1, 32, 14, 14, 8], 
        [16, 32, 3, 3, 8, 32], 
        [16, 1, 1, 32], 
        [16, 1, 1, 32], 
        [1, 16, 7, 7, 32], 
        [1, 1, 7, 7, 512], 
        [16, 1, 3, 3, 512, 32], 
        [16, 1, 1, 32], 
        [16, 1, 1, 32], 
        [1, 16, 7, 7, 32], 
        [1, 16, 7, 7, 32], 
        [1, 1, 7, 7, 512], 
        [16, 1, 3, 3, 512, 32], 
        [16, 1, 1, 32], 
        [16, 1, 1, 32], 
        [1, 16, 7, 7, 32], 
        [1, 1, 7, 7, 512], 
        [16, 1, 3, 3, 512, 32], 
        [16, 1, 1, 32], 
        [16, 1, 1, 32], 
        [1, 16, 7, 7, 32], 
        [1, 16, 1, 1, 32], 
        [1, 512], 
        [1000, 512], 
        [1000], 
        [1, 1000], 
        [1, 1000]]]
  }
}